[
  {
    "name": "Two of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 2,
      "meaning": "Two symbolizes connection and cooperation — the dance between self and other, emotion and reflection, love and boundary. It teaches harmony through mutual recognition."
    },
    "theme": "connection, trust, emotional reciprocity",
    "upright": "The Two of Cups embodies the meeting of hearts — a mirror moment where empathy and vulnerability create harmony. This card reflects the numerology of two: the power of partnership and mutual recognition. When upright, it signals emotional equilibrium, deepened trust, and shared growth. Healthy exchange requires honesty and boundaries in equal measure. Love here is not fantasy but emotional fluency — the ability to stay open while remaining whole.",
    "reversed": "Reversed, the Two of Cups warns of imbalance or emotional enmeshment. The bond may have slipped into overdependence or avoidance, where fear replaces openness. The numerology of two reminds you that connection cannot thrive without differentiation — love is not fusion but dialogue. Step back to restore your center. Emotional repair begins not in apology but in self-awareness and choice.",
    "guidance": "Honor both giving and receiving. Harmony is sustained through truth-telling, not constant agreement.",
    "call_to_action": "Initiate one act of genuine communication today — say what you feel with clarity and compassion."
  },
  {
    "name": "Two of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 2,
      "meaning": "Two represents balance and adaptation — the ability to harmonize opposites through flexibility and rhythm. It asks for conscious juggling of the material and emotional worlds."
    },
    "theme": "adaptability, prioritization, steady rhythm",
    "upright": "The Two of Pentacles dances with duality — the physical embodiment of balance in motion. The numerology of two expresses partnership between effort and ease, demand and rest. Upright, it suggests resourcefulness: you’re juggling obligations with grace, learning that flexibility is a form of strength. True stability comes not from control but from rhythm — knowing when to act and when to pause. Adjust, refine, and flow with what is.",
    "reversed": "Reversed, this card signals imbalance or overwhelm. The rhythm has become strain, not flow; priorities have blurred. The number two teaches that equilibrium requires choice — saying no is as sacred as showing up. Simplify commitments before exhaustion empties your reserves. You cannot hold abundance with clenched hands.",
    "guidance": "Focus on alignment rather than perfection. Productivity without purpose only breeds depletion.",
    "call_to_action": "Reassess your commitments. Drop one task that feels obligatory but not essential."
  },
  {
    "name": "Two of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 2,
      "meaning": "Two embodies reflection and polarity — the pause between thoughts where insight is born. It teaches discernment and the capacity to hold tension until clarity forms."
    },
    "theme": "decision, clarity, mental equilibrium",
    "upright": "The Two of Swords represents the still point before choice — intellect poised between possibilities. The numerology of two speaks to discernment and dual perception. Upright, it calls for calm analysis without emotional suppression. Sometimes the answer is not yet visible because both options reflect truth in part. Seek understanding, not control; clarity arrives through stillness, not haste. Silence can be the most intelligent strategy.",
    "reversed": "When reversed, confusion has become paralysis. Analysis turns into avoidance, and indecision erodes confidence. The lesson of two reminds you: neutrality isn’t peace if it denies feeling. Allow the emotional data to inform the mental one. Movement, however small, breaks the illusion of stuckness.",
    "guidance": "Balance thought with emotion. A choice made in alignment feels peaceful, not perfect.",
    "call_to_action": "Name the decision you’ve been postponing, and take one concrete step toward resolution."
  },
  {
    "name": "Two of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 2,
      "meaning": "Two stands for direction and cooperation — the bridge between inspiration and manifestation. It urges measured confidence: planning that honors both will and patience."
    },
    "theme": "vision, initiative, strategic expansion",
    "upright": "The Two of Wands captures the moment vision meets will. The numerology of two transforms impulse into direction — the raw spark of the Ace now seeks purpose and partnership. Upright, it suggests planning with passion: aligning desire with clear intention. You stand between the known and the possible. Confidence grows when you pair imagination with pragmatic steps.",
    "reversed": "Reversed, this card reveals scattered fire — potential without commitment. The drive to begin may be diluted by self-doubt or conflicting aims. The number two reminds you that ambition must anchor to reality. A dream unacted upon becomes restlessness; strategy turns inspiration into impact.",
    "guidance": "Channel your fire into form. Vision matures through consistency, not speed.",
    "call_to_action": "Define one tangible goal that bridges your current position to your long-term aim."
  }
]
[
  {
    "name": "Three of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 3,
      "meaning": "Three is the pulse of creation — where two unite to birth expression. It sings of joy, shared emotion, and the rhythm of hearts moving in harmony."
    },
    "theme": "celebration, friendship, emotional expression",
    "upright": "The Three of Cups invites you to celebrate connection. It marks a season of shared joy, where community amplifies growth and love flows freely. This is emotional artistry — weaving gratitude and belonging into the fabric of your daily life. Let laughter and empathy replenish your spirit. Creativity blossoms in the company of open hearts.",
    "reversed": "Reversed, this card warns of dissonance within your circles — perhaps comparison, overindulgence, or misplaced trust. The joy of three turns brittle when authenticity fades. Restore harmony by returning to sincerity. Choose quality of connection over quantity of company.",
    "guidance": "Nurture the relationships that make you feel most alive. Joy shared is energy multiplied.",
    "call_to_action": "Gather your people, even briefly — one shared moment of laughter heals more than solitude ever could."
  },
  {
    "name": "Three of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 3,
      "meaning": "Three builds upon two’s balance — it is the architecture of progress. It speaks of craft, cooperation, and the sacred labor that turns skill into art."
    },
    "theme": "collaboration, mastery, contribution",
    "upright": "The Three of Pentacles celebrates purposeful work and teamwork grounded in respect. Upright, it signals that your effort is being seen — and that mastery deepens through collaboration. The numerology of three reminds you that no craft thrives in isolation. Shared vision refines technique; humility refines talent. Build with care, and let patience guide the rhythm.",
    "reversed": "Reversed, it reveals disharmony in collective effort — ego disrupting progress, or work done without recognition. Comparison poisons craftsmanship. Reclaim your focus by reconnecting to the purpose behind your work. Collaboration, not competition, ensures longevity.",
    "guidance": "Work with others, not for approval but for evolution. Cooperation transforms effort into legacy.",
    "call_to_action": "Seek feedback today from someone whose insight sharpens, not flatters, your skill."
  },
  {
    "name": "Three of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 3,
      "meaning": "Three is expression after tension — the truth breaking open. It carries the ache of awareness and the clarity that can only arrive through vulnerability."
    },
    "theme": "truth, release, emotional clarity",
    "upright": "The Three of Swords unveils the healing hidden inside heartbreak. Upright, it calls for honest acknowledgment of pain — to name what hurts without letting it define you. The numerology of three reminds you that growth is the third force born from duality: pain and understanding. What is breaking is not the heart, but its old defense. Clarity is mercy in disguise.",
    "reversed": "Reversed, this card suggests resistance to feeling or fixation on old wounds. Avoiding sorrow only prolongs it. Let tears be translators of wisdom. The heart knows how to mend when given truth and time.",
    "guidance": "Do not rush the healing. Pain is a teacher whose lessons grow gentler when heard.",
    "call_to_action": "Write a single sentence that names what you’ve been avoiding — honesty begins the repair."
  },
  {
    "name": "Three of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 3,
      "meaning": "Three is expansion — fire discovering form. It is the courage to envision beyond the known and to act with faith in unseen horizons."
    },
    "theme": "progress, foresight, exploration",
    "upright": "The Three of Wands marks a moment of momentum and vision. Upright, it shows your plans gaining distance and coherence. The numerology of three propels growth through imagination joined with commitment. This is the card of the visionary who dares to look further while tending the flame at home. The horizon responds to readiness, not haste.",
    "reversed": "Reversed, impatience or self-doubt may be clouding your path. You might be looking outward while neglecting what fuels you within. The number three reminds you that expansion must be anchored in meaning — not motion alone. Refine before you rush.",
    "guidance": "Every long journey begins with a recalibrated compass. Direction, not distance, measures success.",
    "call_to_action": "Revisit your vision. Adjust one detail to make it feel more aligned with your present values."
  }
]
[
  {
    "name": "Four of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 4,
      "meaning": "Four is the stillness after growth — a container for reflection. It teaches the wisdom of pause: to appreciate, to recalibrate, to remember what truly nourishes the heart."
    },
    "theme": "introspection, emotional renewal, reevaluation",
    "upright": "The Four of Cups appears when life invites you to look inward rather than outward for fulfillment. Upright, it asks you to pause before reaching for the next desire and to feel the truth of what’s already here. The numerology of four offers rest after expansion — a sanctuary for emotional digestion. What feels dull may simply need gratitude to regain color. Discontent is a compass, not a flaw.",
    "reversed": "Reversed, apathy has hardened into withdrawal. The emotional walls that once protected you now isolate you from joy. The lesson of four reminds you that stability becomes stagnation when fear refuses movement. Reach for renewal through curiosity, not obligation. The smallest gesture of engagement can reopen the heart.",
    "guidance": "When wonder fades, look closer, not further. Stillness reveals what distraction conceals.",
    "call_to_action": "List three things you already have that once felt like dreams. Gratitude is the doorway back to vitality."
  },
  {
    "name": "Four of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 4,
      "meaning": "Four builds walls and roots alike. It represents the instinct to protect, to conserve, to define one’s domain — stability in its material and psychological forms."
    },
    "theme": "security, control, groundedness",
    "upright": "The Four of Pentacles represents stability earned through effort. Upright, it reflects healthy structure — creating boundaries, managing resources, defining what truly sustains you. The numerology of four honors order and stewardship. Yet it whispers caution: hold your success with open hands. True security expands when generosity replaces fear.",
    "reversed": "Reversed, attachment has eclipsed ease. You may be gripping possessions, titles, or beliefs that once provided safety but now restrict growth. The energy of four reminds you that control can’t protect what love must renew. Loosen your hold, and prosperity will find room to breathe.",
    "guidance": "Wealth multiplies through flow, not accumulation. Structure serves you best when it bends.",
    "call_to_action": "Release one habit of scarcity thinking — give, share, or trust in circulation today."
  },
  {
    "name": "Four of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 4,
      "meaning": "Four is restoration through stillness — the mind’s exhale. It embodies the sacred rest that transforms reflection into strength."
    },
    "theme": "rest, recovery, mental clarity",
    "upright": "The Four of Swords invites retreat — a pause to restore what effort has frayed. Upright, it speaks of deliberate rest: silence as medicine, solitude as integration. The numerology of four grounds thought into rhythm, reminding you that wisdom ripens in quiet. You are not falling behind; you are gathering coherence. When the mind stops racing, insight returns home.",
    "reversed": "Reversed, exhaustion has replaced contemplation. The need for rest is denied, disguised as productivity. Burnout hides beneath busyness. The lesson of four urges surrender before collapse. Rest is not retreat from purpose; it is preparation for precision.",
    "guidance": "Rest is an act of strategy, not indulgence. Stillness is the sharpest tool in recovery.",
    "call_to_action": "Take one full hour to be unreachable — no screens, no noise, just breath and space."
  },
  {
    "name": "Four of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 4,
      "meaning": "Four is foundation — the home built beneath the flame. It celebrates stability achieved through effort and the joy that arises from shared creation."
    },
    "theme": "stability, community, joyful achievement",
    "upright": "The Four of Wands marks a moment of completion — the joy of structure fulfilled. Upright, it signifies harmony within action: projects stabilized, relationships strengthened, energy balanced. The numerology of four is both anchor and celebration — it reminds you that freedom is sustained through form. This card invites you to honor milestones and to rest within the safety of what you’ve built.",
    "reversed": "Reversed, the foundation wobbles. Celebration may feel forced, or belonging uncertain. The number four reveals that achievement without emotional connection rings hollow. Return to authenticity. Repair before expansion. Home is less a place than the peace between collaborators.",
    "guidance": "Stability is sacred when it’s shared. Celebrate the bonds that make your fire sustainable.",
    "call_to_action": "Mark a small victory today — light a candle, toast your effort, or thank your allies aloud."
  }
]
[
  {
    "name": "Five of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 5,
      "meaning": "Five is motion within emotion — the tide that turns after calm waters. It teaches that loss and renewal coexist, each wave carving wisdom from the heart."
    },
    "theme": "grief, acceptance, emotional growth",
    "upright": "The Five of Cups acknowledges the ache of disappointment. Upright, it invites honest mourning — to face what was lost without collapsing into it. The numerology of five introduces movement into still water; grief becomes a river carrying you forward. Focus not only on what spilled, but on what remains to be refilled. Healing begins when you stop mistaking sadness for failure.",
    "reversed": "Reversed, the sorrow has turned to fixation. Emotional gravity holds you in yesterday’s tide. The lesson of five urges forgiveness — not to forget, but to reclaim flow. Your heart is wiser now; let it reopen. Regret loses power when transformed into understanding.",
    "guidance": "Grieve fully, then lift your gaze. The future waits for your willingness, not your perfection.",
    "call_to_action": "Name one thing you’ve learned from a recent loss, and let that insight become your new beginning."
  },
  {
    "name": "Five of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 5,
      "meaning": "Five is the tension between need and resource — the breaking point that reveals community, humility, and the strength of asking for help."
    },
    "theme": "scarcity, vulnerability, mutual support",
    "upright": "The Five of Pentacles speaks to moments of material or emotional depletion. Upright, it’s a call to reach outward rather than retreat inward. The numerology of five shakes comfort to awaken interdependence. This is not a card of punishment but of perspective — reminding you that lack often hides abundance in different form. Connection is currency; vulnerability is strength.",
    "reversed": "Reversed, the isolation begins to thaw. You are rediscovering support after hardship. The challenge now is to receive it without shame. The energy of five teaches that resilience grows in community, not solitude. Healing the sense of ‘not enough’ restores belonging.",
    "guidance": "You are not measured by possessions, but by participation. Need is an invitation to connect.",
    "call_to_action": "Accept one offer of help today, no matter how small. Let generosity move both ways."
  },
  {
    "name": "Five of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 5,
      "meaning": "Five is the storm of the mind — conflict that exposes ego and truth alike. It clears illusion through friction, demanding humility in victory and grace in defeat."
    },
    "theme": "conflict, perspective, integrity",
    "upright": "The Five of Swords arises when words have cut deeper than intended. Upright, it reveals the cost of proving right over being wise. The numerology of five brings mental turbulence to reveal hidden motives. Winning a small battle may lose a larger peace. Step back, breathe, and question whether the conflict feeds clarity or pride. Truth rarely shouts — it steadies.",
    "reversed": "Reversed, it suggests reconciliation after tension. The mind is tired of defense; understanding feels more valuable than dominance. The number five transforms struggle into self-awareness — a pivot from argument to authenticity. Peace is not surrender but evolution.",
    "guidance": "Choose curiosity over control. Listening is the sharpest form of intelligence.",
    "call_to_action": "Initiate one honest conversation where your goal is to understand, not persuade."
  },
  {
    "name": "Five of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 5,
      "meaning": "Five is fire uncontained — the creative friction that tests will and refines purpose. It sparks challenge so that passion can mature into direction."
    },
    "theme": "competition, growth through tension, creative assertion",
    "upright": "The Five of Wands brings dynamic tension — lively debate, creative conflict, or clashing visions. Upright, it signals growth through resistance. The numerology of five stirs movement where stagnation once stood. Competition becomes productive when it stays playful and honest. Let friction polish your intent, not harden your pride. Diversity of thought is fuel for innovation.",
    "reversed": "Reversed, this energy turns chaotic or draining. Disagreement becomes discord, ambition turns to comparison. The number five reminds you that not every spark deserves a flame. Step back to rediscover collaboration over combat. Assert without aggression; lead without domination.",
    "guidance": "Struggle reveals what you value most. Use that knowledge to refine your purpose.",
    "call_to_action": "Transform one point of friction into cooperation today — invite input instead of defending position."
  }
]
[
  {
    "name": "Six of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 6,
      "meaning": "Six is the heart remembering its rhythm — the harmony that follows healing. It evokes nostalgia, care, and the sweetness of emotional equilibrium restored."
    },
    "theme": "memory, kindness, emotional renewal",
    "upright": "The Six of Cups returns you to gentler waters. Upright, it honors memory not as escape, but as nourishment — the past offering perspective to the present. The numerology of six restores the emotional rhythm disrupted by loss. Acts of kindness flow easily now; joy reawakens through simplicity. Give without calculation, receive without guilt. Love is both the lesson and the reward.",
    "reversed": "Reversed, the past has become an anchor rather than a guide. Clinging to nostalgia clouds present intimacy. The energy of six asks you to integrate, not idealize, what was. Release the story that innocence must be lost to grow — maturity can still be tender.",
    "guidance": "Let memory soften you, not bind you. Gratitude transforms what once hurt into wisdom.",
    "call_to_action": "Reconnect with someone from your past — not to relive, but to recognize how both of you have evolved."
  },
  {
    "name": "Six of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 6,
      "meaning": "Six is reciprocity made visible — the sacred balance of giving and receiving. It teaches that abundance circulates when generosity and self-respect walk hand in hand."
    },
    "theme": "generosity, equity, mutual benefit",
    "upright": "The Six of Pentacles speaks of generosity, both material and emotional. Upright, it marks a time when resources flow again — not hoarded, but shared wisely. The numerology of six restores fairness to the physical world: giving as service, receiving as humility. Prosperity expands when energy moves freely. Kindness offered without expectation multiplies in unseen ways.",
    "reversed": "Reversed, imbalance distorts generosity into control or dependency. The lesson of six reminds you that real giving requires equality, not hierarchy. Beware of guilt disguised as charity or pride masked as help. Reclaim integrity by aligning your exchanges with mutual respect.",
    "guidance": "True wealth is measured in circulation, not accumulation. Every act of fairness restores the field.",
    "call_to_action": "Offer or request help today without apology — let balance find its natural rhythm through exchange."
  },
  {
    "name": "Six of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 6,
      "meaning": "Six is transition with grace — the crossing from chaos to coherence. It is thought tempered by compassion, intellect reuniting with peace."
    },
    "theme": "healing, transition, restored clarity",
    "upright": "The Six of Swords signals movement toward calmer terrain — a passage out of mental or emotional turbulence. Upright, it affirms progress through perspective. The numerology of six reminds you that peace is built, not stumbled upon. You’ve done the hard thinking; now comes integration. Even slow crossings count as momentum when your heart travels lighter.",
    "reversed": "Reversed, the journey hesitates. You may cling to familiar pain or resist necessary distance. The number six encourages trust in transition — uncertainty is still progress in disguise. Don’t measure healing by speed but by direction. The lesson isn’t to escape the past, but to travel through it consciously.",
    "guidance": "Healing is not a straight road but a gentle ferry — trust the current to carry what effort alone cannot.",
    "call_to_action": "Name one mental weight you’re ready to set down, and let perspective move you forward."
  },
  {
    "name": "Six of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 6,
      "meaning": "Six is triumph harmonized with humility — success shared, not hoarded. It radiates recognition, confidence, and the restoration of purpose through community."
    },
    "theme": "victory, recognition, alignment of purpose",
    "upright": "The Six of Wands heralds a well-earned victory. Upright, it celebrates progress made visible — a moment to stand tall and acknowledge effort turned to achievement. The numerology of six infuses pride with grace, reminding you that triumph matures when shared. Your success inspires others because it was built with integrity, not performance. Enjoy the view without forgetting the climb.",
    "reversed": "Reversed, this energy falters under self-doubt or inflated ego. Recognition may feel hollow or elusive. The number six calls you back to purpose — achievement without authenticity quickly fades. Reclaim motivation through service, not applause. The real win is staying true to your fire.",
    "guidance": "Celebrate without comparison. Confidence is most magnetic when it’s generous.",
    "call_to_action": "Acknowledge one accomplishment — aloud or in writing — and let gratitude, not pride, be your victory speech."
  }
]
[
  {
    "name": "Seven of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 7,
      "meaning": "Seven is reflection made dreamlike — the mirror between illusion and insight. It teaches discernment: that not all desires are destinies."
    },
    "theme": "choices, imagination, discernment",
    "upright": "The Seven of Cups opens a gallery of possibilities — visions shimmering with both promise and distraction. Upright, it invites you to dream boldly while choosing wisely. The numerology of seven infuses contemplation into emotion, asking you to separate genuine longing from fleeting fantasy. Imagination is sacred when anchored to purpose. What truly calls you will remain when glamour fades.",
    "reversed": "Reversed, the options feel overwhelming or deceptive. You may be chasing escape rather than alignment. The lesson of seven is clarity through narrowing — fewer choices, deeper meaning. Step out of the fog and trust your intuition to name what’s real. Commitment clears confusion.",
    "guidance": "Every illusion begins as an unmet need. Understanding the desire beneath the dream reveals the truth you seek.",
    "call_to_action": "List your current desires and ask of each: does this feed my soul or distract my focus?"
  },
  {
    "name": "Seven of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 7,
      "meaning": "Seven is patience embodied — the farmer’s number. It measures time through effort and faith, teaching that growth unfolds by natural law, not personal demand."
    },
    "theme": "patience, evaluation, steady progress",
    "upright": "The Seven of Pentacles represents mindful pause — the moment to review what your labor has sown. Upright, it encourages evaluation without judgment. The numerology of seven rewards consistency and foresight: progress is happening beneath the surface. Resist the urge to harvest prematurely. Wisdom in work means trusting unseen roots. Your persistence is the quiet architect of success.",
    "reversed": "Reversed, frustration clouds perspective. Impatience tempts you to abandon what’s ripening or overinvest in what’s lost momentum. The energy of seven reminds you that growth cannot be forced — only fostered. Step back, breathe, and refine your methods rather than your worth.",
    "guidance": "Measure progress by alignment, not speed. Even pauses are productive when intention stays true.",
    "call_to_action": "Revisit your long-term goals — prune one task that drains without feeding your greater purpose."
  },
  {
    "name": "Seven of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 7,
      "meaning": "Seven is the seeker’s mind — strategy meeting conscience. It examines motive, revealing that wisdom without integrity dissolves into deceit."
    },
    "theme": "strategy, truth, self-awareness",
    "upright": "The Seven of Swords appears when discernment becomes a test of honesty. Upright, it suggests careful strategy — moving intelligently, not impulsively. Yet the numerology of seven asks for ethical clarity: success gained through deceit fractures the spirit. Protect your ideas, but not at the cost of your peace. The clever path and the wise path are not always the same; choose integrity over immediacy.",
    "reversed": "Reversed, secrecy unravels or self-deception comes to light. The number seven insists on accountability — truth wants to be known. Reclaim authenticity by admitting what fear tried to hide. Liberation follows transparency. When you tell the truth, even silently, your energy realigns.",
    "guidance": "Integrity is intelligence’s highest form. Strategy guided by conscience becomes wisdom in action.",
    "call_to_action": "Reveal one truth you’ve been withholding — from others or yourself — and let honesty reset the field."
  },
  {
    "name": "Seven of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 7,
      "meaning": "Seven is conviction tested — courage under pressure. It refines will through resistance, turning belief into embodied strength."
    },
    "theme": "defense, conviction, perseverance",
    "upright": "The Seven of Wands signals a challenge to your stance — not punishment, but proof of commitment. Upright, it represents courage forged through contrast. The numerology of seven transforms conflict into refinement: standing firm clarifies what truly matters. When integrity meets opposition, authenticity sharpens. Protect your light, but let humility temper the flame.",
    "reversed": "Reversed, fatigue or doubt may soften your resolve. You might be fighting every battle instead of the right one. The energy of seven reminds you that defense without discernment drains vitality. Step back and choose where your fire belongs. Boundaries are not barriers; they are self-respect in form.",
    "guidance": "Conviction without rigidity is power with grace. Let challenge shape, not shatter, your purpose.",
    "call_to_action": "Identify one stand you’re taking out of fear rather than faith — and release it to regain your strength."
  }
]
[
  {
    "name": "Eight of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 8,
      "meaning": "Eight is movement with meaning — the soul’s departure in search of authenticity. It teaches mastery through release, reminding us that true success is measured by alignment, not attachment."
    },
    "theme": "departure, self-discovery, emotional mastery",
    "upright": "The Eight of Cups marks the quiet courage of walking away. Upright, it shows emotional maturity — the choice to leave what no longer nourishes. The numerology of eight moves energy from stagnation to purpose. Growth now means honesty: admitting that comfort can conceal complacency. This is a sacred pilgrimage toward wholeness, not a rejection of the past but a reclamation of self.",
    "reversed": "Reversed, you may hesitate to leave the familiar, clinging to routines that have outlived their meaning. The lesson of eight reminds you that strength includes surrender. Staying where your spirit shrinks is the costliest form of loyalty. Freedom begins the moment you accept what has already ended.",
    "guidance": "Mastery of emotion requires movement. When the heart says go, trust that wisdom walks beside you.",
    "call_to_action": "Release one commitment or pattern that drains your vitality — even a small letting-go opens new flow."
  },
  {
    "name": "Eight of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 8,
      "meaning": "Eight is craftsmanship in motion — the sacred repetition that refines skill into art. It embodies discipline, devotion, and the patient joy of mastery earned through practice."
    },
    "theme": "skill, dedication, self-improvement",
    "upright": "The Eight of Pentacles celebrates steady mastery. Upright, it reveals satisfaction born of persistence — the rhythm of effort turning intention into excellence. The numerology of eight honors structure as a conduit for creativity. Your diligence shapes destiny one deliberate action at a time. Progress thrives where focus and humility coexist. The work itself becomes meditation.",
    "reversed": "Reversed, perfectionism or monotony dulls the spark. You may be mistaking busyness for purpose. The energy of eight reminds you that true mastery requires rest as much as repetition. Reconnect with meaning before the craft becomes a cage. Refinement, not rigidity, sustains brilliance.",
    "guidance": "Consistency is sacred when paired with curiosity. Let every repetition reveal something new.",
    "call_to_action": "Revisit your craft with fresh eyes — learn one new technique that rekindles enthusiasm."
  },
  {
    "name": "Eight of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 8,
      "meaning": "Eight is the mirror of power — showing both limitation and liberation. It teaches that mastery of thought begins when we recognize which bindings are self-made."
    },
    "theme": "restriction, perception, mental liberation",
    "upright": "The Eight of Swords portrays confinement born of perspective. Upright, it reveals how fear and self-talk construct invisible walls. The numerology of eight challenges you to reclaim authority over your narrative. The cage is crafted by thought; awareness holds the key. Clarity returns when compassion replaces critique. You are not trapped — only trained to doubt your own permission.",
    "reversed": "Reversed, light seeps through the bars. Recognition dissolves restriction. The number eight marks liberation through insight — realizing that limits once kept you safe but no longer serve. Choose response over reaction. Every step toward self-trust widens the path.",
    "guidance": "Freedom begins as an internal decision. Master your mind, and the world rearranges around it.",
    "call_to_action": "Challenge one belief that keeps you small. Replace it with a thought rooted in truth, not fear."
  },
  {
    "name": "Eight of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 8,
      "meaning": "Eight is acceleration — energy moving cleanly through intention. It symbolizes momentum aligned with clarity, the swift harmony of purpose and timing."
    },
    "theme": "momentum, communication, decisive movement",
    "upright": "The Eight of Wands bursts with motion and timing. Upright, it heralds rapid progress and clear signals from the universe: things are aligning. The numerology of eight channels focused energy into manifestation — movement without resistance. Act while the current runs strong; clarity loves momentum. Trust instinct and stay present; what unfolds now is the result of prior alignment.",
    "reversed": "Reversed, delay or disarray clouds the flow. Impatience scatters focus. The lesson of eight is that mastery includes pacing — not every opening requires pursuit. Re-center, clarify intention, and let timing recalibrate. Pausing now ensures precision later.",
    "guidance": "Speed is sacred only when direction is clear. Channel passion; don’t chase it.",
    "call_to_action": "Choose one goal and commit to a single focused action today — let energy gather, not disperse."
  }
]
[
  {
    "name": "Nine of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 9,
      "meaning": "Nine is emotional fruition — the quiet joy of wholeness found within. It is contentment earned through gratitude, reminding us that fulfillment deepens through appreciation, not accumulation."
    },
    "theme": "satisfaction, emotional fulfillment, gratitude",
    "upright": "The Nine of Cups radiates contentment — the peace that comes from aligning inner desire with outer reality. Upright, it speaks of dreams realized and the pleasure of being present to your own life. The numerology of nine celebrates maturity of the heart: joy that no longer needs permission. When gratitude becomes your rhythm, abundance follows naturally. Happiness is not chased; it’s recognized.",
    "reversed": "Reversed, this energy warns against indulgence or hollow achievement. You may have reached a goal but lost the feeling that inspired it. The lesson of nine is that satisfaction without soul feels temporary. Reconnect to meaning beyond comfort. The truest wish is often simplicity rediscovered.",
    "guidance": "Fulfillment is not an endpoint but a practice — one shaped by presence and appreciation.",
    "call_to_action": "Pause to savor what is working well. Say thank you aloud; make joy conscious and tangible."
  },
  {
    "name": "Nine of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 9,
      "meaning": "Nine is self-sufficiency realized — the wisdom of earned comfort. It reflects refinement and the serenity that arrives when effort and integrity align."
    },
    "theme": "independence, accomplishment, self-worth",
    "upright": "The Nine of Pentacles honors confidence born of discipline. Upright, it reflects material and spiritual balance — the grace of enjoying what you’ve built without apology. The numerology of nine carries the resonance of elegance and autonomy. You’ve learned that stability comes from stewardship, not possession. Celebrate your capability; luxury here means peace of mind.",
    "reversed": "Reversed, it warns of isolation behind self-reliance. Achievement without connection can feel hollow. The energy of nine reminds you that self-worth thrives through sharing. Invite others into your abundance; generosity affirms your wholeness.",
    "guidance": "True independence is interdependence understood. You shine brightest when your success uplifts others.",
    "call_to_action": "Indulge in a moment of well-earned rest — then express gratitude by mentoring or giving where you once needed support."
  },
  {
    "name": "Nine of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 9,
      "meaning": "Nine is awakening through endurance — the mind confronting its shadows. It transforms fear into understanding, teaching that awareness is the beginning of peace."
    },
    "theme": "anxiety, realization, release through awareness",
    "upright": "The Nine of Swords illuminates worry and the weight of sleepless thoughts. Upright, it calls you to face inner fears rather than flee them. The numerology of nine reveals that anxiety peaks before breakthrough — clarity dawns through confrontation, not avoidance. What you name loses power; what you breathe through begins to dissolve. Healing here begins with self-compassion.",
    "reversed": "Reversed, the light of awareness begins to pierce the dark. You are releasing guilt, shame, or outdated narratives. The energy of nine brings closure through courage: the willingness to forgive yourself. Recovery is the reward of reckoning.",
    "guidance": "Fear shrinks in the light of understanding. Speak your worry aloud; it transforms into insight.",
    "call_to_action": "Write down the thought that keeps looping. Beneath it, note one truth that softens it — that’s your medicine."
  },
  {
    "name": "Nine of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 9,
      "meaning": "Nine is endurance at dusk — strength carrying wisdom’s weight. It honors perseverance and the resolve to finish strong, even when weary."
    },
    "theme": "resilience, perseverance, protection of purpose",
    "upright": "The Nine of Wands stands as the guardian of persistence. Upright, it signals hard-won strength — the courage to continue even as fatigue sets in. The numerology of nine marks wisdom through endurance: experience has tempered your fire, not extinguished it. You now know when to fight, when to rest, and when to trust your foundation. Perseverance is sacred when guided by purpose.",
    "reversed": "Reversed, defensiveness overtakes discernment. You may be bracing for battles long ended. The lesson of nine is release through trust — not every wall protects; some isolate. Rest does not equal surrender; it replenishes readiness.",
    "guidance": "Endurance matures into wisdom when you choose rest as part of strength.",
    "call_to_action": "Lay down one armor you’ve outgrown — a defense, a habit, or a story — and let your resilience breathe."
  }
]
[
  {
    "name": "Ten of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 10,
      "meaning": "Ten is emotional culmination — the return of love to its source. It unites heart and spirit, revealing joy as a shared vibration, not a private possession."
    },
    "theme": "fulfillment, harmony, emotional legacy",
    "upright": "The Ten of Cups is the symphony of contentment — harmony among hearts, gratitude woven through daily life. Upright, it marks emotional maturity and relational peace. The numerology of ten celebrates the completion of love’s arc: happiness that expands beyond self into community and kinship. Here joy is not fragile; it’s reciprocal. What you nurture in others, you sustain within.",
    "reversed": "Reversed, illusions about perfection may cloud contentment. You might compare reality to fantasy and miss the beauty of the imperfect whole. The lesson of ten reminds you that love matures through presence, not performance. Emotional harmony deepens when expectations soften into appreciation.",
    "guidance": "Happiness multiplies when shared. The dream you live daily is the miracle you once wished for.",
    "call_to_action": "Create a small ritual of gratitude with loved ones — a meal, a call, a note — to honor your shared joy."
  },
  {
    "name": "Ten of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 10,
      "meaning": "Ten is the culmination of material mastery — structure meeting soul. It embodies legacy, sustainability, and the wisdom of building something that outlasts the builder."
    },
    "theme": "legacy, abundance, continuity",
    "upright": "The Ten of Pentacles represents stability matured into legacy. Upright, it signifies lasting prosperity, both tangible and intangible — wealth of wisdom, tradition, and care. The numerology of ten integrates success with stewardship: abundance sustained through ethics and foresight. Celebrate what endures. The true inheritance is not possessions, but the integrity they’re managed with.",
    "reversed": "Reversed, it warns of hollow ambition or fractured foundations. Security gained without connection isolates the spirit. The energy of ten teaches that legacy requires love to remain alive. Redefine wealth through what it makes possible for others, not merely what it provides for you.",
    "guidance": "Build for the long term. Prosperity is sacred when it sustains both you and those to come.",
    "call_to_action": "Invest in something enduring — a project, relationship, or cause that carries your values forward."
  },
  {
    "name": "Ten of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 10,
      "meaning": "Ten is the ending that becomes clarity — the release after struggle. It transforms collapse into awakening, closing a chapter so that new truth can rise."
    },
    "theme": "ending, surrender, renewal through acceptance",
    "upright": "The Ten of Swords depicts a painful ending — yet it is also the liberation that follows finality. Upright, it signifies the point where resistance breaks and understanding enters. The numerology of ten carries transcendence through surrender: the mind exhausted enough to yield to truth. What falls away now clears the path for healing. Dawn arrives the moment you stop rehearsing the storm.",
    "reversed": "Reversed, recovery has begun. You are rising from the ashes, reclaiming perspective and power. The lesson of ten is closure with consciousness — learning from what ended without reanimating its pain. Let the old identity dissolve; it served its season.",
    "guidance": "Endings cleanse when faced with grace. Acceptance is not defeat but the birth of renewal.",
    "call_to_action": "Acknowledge what is truly finished. Mark it with a symbolic act — a note burned, a breath released — and face forward."
  },
  {
    "name": "Ten of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 10,
      "meaning": "Ten is culmination through responsibility — energy gathered to its limit. It teaches that mastery requires delegation, rest, and the wisdom to carry only what is yours."
    },
    "theme": "burden, perseverance, release through discernment",
    "upright": "The Ten of Wands speaks of weight carried with devotion. Upright, it shows you near completion — effort crowned by exhaustion. The numerology of ten completes fire’s cycle: passion transformed into endurance. Yet it also asks for recalibration. Carrying everything alone dims the flame it once fueled. Leadership matures when it learns to trust others with the load.",
    "reversed": "Reversed, you may be holding obligations that no longer belong to you. The lesson of ten urges release — progress doesn’t demand martyrdom. Let rest become part of productivity. What you set down clears space for inspiration’s return.",
    "guidance": "Responsibility becomes freedom when guided by discernment. Not every task requires your flame.",
    "call_to_action": "Lighten your day by releasing one unnecessary obligation — the spark you save is your own."
  }
]
[
  {
    "name": "Ace of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 1,
      "meaning": "One is the pulse of birth — undivided emotion becoming awareness. It teaches that love begins as presence: the courage to feel fully, without filter or expectation."
    },
    "theme": "emotional renewal, openness, heart awakening",
    "upright": "The Ace of Cups overflows with possibility. Upright, it signals an opening of the heart — new love, healing, or spiritual renewal. The numerology of one breathes unity into feeling: a fresh current of compassion flowing without agenda. You are being invited to receive, to let tenderness refill your reserves. Love is both seed and soil here — nurture it by staying receptive.",
    "reversed": "Reversed, emotional flow feels blocked or inwardly guarded. You may be protecting yourself from vulnerability. The energy of one asks for gentle reconnection. Pour compassion inward first, and your well will rise again. The heart refills by being used.",
    "guidance": "Sensitivity is not weakness; it’s the measure of your capacity for joy.",
    "call_to_action": "Practice one act of self-kindness today — speak to yourself as you would to someone you adore."
  },
  {
    "name": "Ace of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 1,
      "meaning": "One is manifestation’s seed — spirit descending into matter. It reveals potential in tangible form, reminding us that abundance begins with intention grounded in faith."
    },
    "theme": "new beginnings, opportunity, grounded potential",
    "upright": "The Ace of Pentacles plants the seed of prosperity. Upright, it represents fresh opportunity in the material world — a job, a home, a health goal, or a new phase of stability. The numerology of one marks creation meeting earth: the first step toward something enduring. Your intentions have substance; nurture them with consistency. Every garden begins with a single mindful seed.",
    "reversed": "Reversed, hesitation or scarcity thinking may delay progress. You might doubt your ability to sustain success. The number one invites confidence in small beginnings — wealth grows through stewardship, not speed. Recommit to your foundation and trust time to reveal results.",
    "guidance": "Security is a practice of presence — tending what you have while believing in what’s coming.",
    "call_to_action": "Begin one concrete action toward your goal — however small, let it symbolize belief in your capacity to grow."
  },
  {
    "name": "Ace of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 1,
      "meaning": "One is clarity crystallized — the first thought cutting through fog. It represents truth as creation: awareness shaping reality through focus and honesty."
    },
    "theme": "clarity, insight, decisive truth",
    "upright": "The Ace of Swords arrives like lightning — revelation, understanding, the mind awakening to purpose. Upright, it heralds mental renewal and the power of discernment. The numerology of one sharpens perception: you see what must be seen, no longer dulled by confusion. This is a moment to speak truth cleanly, to begin new plans with integrity. Clarity is your compass; wield it with compassion.",
    "reversed": "Reversed, confusion clouds judgment or words wound instead of clarify. The number one reminds you that truth without empathy cuts too deep. Recenter in honesty that heals rather than divides. Real clarity begins when motives align with meaning.",
    "guidance": "Speech is sacred when guided by self-awareness. Truth is sharpest when shaped by care.",
    "call_to_action": "Write or speak one truth today with courage and kindness — let it clear your inner sky."
  },
  {
    "name": "Ace of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 1,
      "meaning": "One is ignition — divine spark entering matter. It is passion’s first flame, the call to act from inspiration before doubt can intervene."
    },
    "theme": "inspiration, initiation, creative spark",
    "upright": "The Ace of Wands blazes with new vitality. Upright, it signals a burst of energy, creativity, or conviction ready to be channeled into motion. The numerology of one ignites potential — this is the soul’s green light. Begin before you feel fully ready; momentum will teach you what preparation cannot. Inspiration is a living thing — nurture it through action.",
    "reversed": "Reversed, hesitation or burnout dims the spark. You may be second-guessing a calling or delaying the start. The lesson of one urges renewal through simplicity: rekindle passion by reconnecting to purpose, not performance. Fire thrives when given air, not perfection.",
    "guidance": "Creation begins with courage. The flame of will is sacred — protect it from overthinking.",
    "call_to_action": "Take the first step toward your idea today — a note, a draft, a phone call. Action fans inspiration’s flame."
  }
]
[
  {
    "name": "Page of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 11,
      "meaning": "Eleven is awakening through sensitivity — the bridge between feeling and expression. It whispers of curiosity born from empathy, where innocence meets intuition."
    },
    "theme": "emotional curiosity, creative openness, intuition",
    "upright": "The Page of Cups arrives with a tender message from the heart. Upright, it embodies wonder — the willingness to feel before knowing, to trust the unknown with softness. The numerology of eleven awakens intuitive perception: emotion becoming imagination, imagination becoming art. This Page learns through feeling deeply and expressing sincerely. Love begins again when curiosity replaces defense.",
    "reversed": "Reversed, emotional immaturity or avoidance may cloud connection. You might be reacting rather than relating. The energy of eleven asks for emotional education — to listen inwardly before projecting outwardly. Vulnerability is strength when paired with self-awareness.",
    "guidance": "Let innocence lead without naivety. The heart’s questions are often wiser than the mind’s answers.",
    "call_to_action": "Express what you feel in one creative or honest act today — a note, a gesture, a truth shared gently."
  },
  {
    "name": "Page of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 11,
      "meaning": "Eleven is the moment of discovery — curiosity grounded in form. It turns observation into practice, reminding that mastery begins with mindful repetition."
    },
    "theme": "study, ambition, grounded learning",
    "upright": "The Page of Pentacles is the student of stability. Upright, it signals enthusiasm for new work, study, or purpose. The numerology of eleven connects insight to embodiment: ideas seeking application, dreams finding soil. This Page learns by doing and honors patience as progress. Each small effort plants the roots of long-term success.",
    "reversed": "Reversed, distraction or doubt may disrupt focus. You may resist the slow pace of true mastery. The lesson of eleven is humility — curiosity over certainty, practice over perfection. Begin again without self-judgment; repetition refines everything.",
    "guidance": "Stay teachable. Every humble start contains the architecture of expertise.",
    "call_to_action": "Take one deliberate, practical step toward learning something that builds future stability."
  },
  {
    "name": "Page of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 11,
      "meaning": "Eleven is mental ignition — the awakening of curiosity through communication. It embodies thought discovering its wings, words turning into awareness."
    },
    "theme": "curiosity, observation, new ideas",
    "upright": "The Page of Swords is the mind’s messenger — sharp, inquisitive, and alert. Upright, it calls for clear communication and active learning. The numerology of eleven carries a student’s wonder refined by reason: curiosity guided by discernment. This Page explores truth like a scientist and storyteller combined. Ask questions, but also listen for nuance — knowledge grows in both directions.",
    "reversed": "Reversed, the energy scatters — gossip, defensiveness, or analysis without empathy. The lesson of eleven urges mental maturity: use words to clarify, not to cut. Thought without compassion isolates the intellect from wisdom.",
    "guidance": "Question everything, including your assumptions. Truth sharpens best when tempered by humility.",
    "call_to_action": "Pause before speaking today; choose one phrase that turns reaction into genuine inquiry."
  },
  {
    "name": "Page of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 11,
      "meaning": "Eleven is inspiration awakening — the first flicker of identity meeting purpose. It carries the daring spark that says: try, risk, explore."
    },
    "theme": "enthusiasm, exploration, creative discovery",
    "upright": "The Page of Wands bursts onto the scene full of excitement and possibility. Upright, it’s the call to begin — to explore passion without knowing the map. The numerology of eleven radiates initiation through curiosity: courage before certainty, joy before judgment. This Page learns by movement and fire, trusting instinct to find direction. Enthusiasm itself is the teacher.",
    "reversed": "Reversed, restlessness or inconsistency may scatter your energy. You might be starting many fires without tending any. The energy of eleven reminds you that curiosity becomes purpose through follow-through. Channel excitement into one chosen path; depth feeds flame better than speed.",
    "guidance": "Let inspiration move through action. Fear is only stagnation asking for expression.",
    "call_to_action": "Take one small bold step today — something that quickens your pulse and reminds you that you’re alive."
  }
]
[
  {
    "name": "Knight of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 12,
      "meaning": "Twelve is devotion in motion — heart energy seeking reflection. It symbolizes empathy on a quest, where idealism meets intimacy and emotion becomes art in action."
    },
    "theme": "romance, idealism, emotional expression",
    "upright": "The Knight of Cups rides on dreams and feeling. Upright, it represents romantic movement — invitations, artistic expression, or emotional offering. The numerology of twelve turns sensitivity into experience: learning how to love in real time, not just imagine it. This Knight follows beauty as compass, discovering that sincerity matters more than perfection. To move with heart is to create harmony in motion.",
    "reversed": "Reversed, fantasy overtakes follow-through. Emotional intensity becomes performance or avoidance. The lesson of twelve reminds you that compassion must walk beside clarity. Don’t chase ideal love; build honest connection. Dreams without grounding dissolve into drama.",
    "guidance": "Let feeling inspire action but not replace it. Love matures through presence, not promises.",
    "call_to_action": "Deliver one genuine expression of care — write, speak, or act upon what your heart has been holding back."
  },
  {
    "name": "Knight of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 12,
      "meaning": "Twelve is diligence unfolding — motion made methodical. It blends drive with discipline, teaching progress through patience and consistency."
    },
    "theme": "dedication, reliability, long-term growth",
    "upright": "The Knight of Pentacles is the steward of steady effort. Upright, it reflects persistence, loyalty, and commitment to craft. The numerology of twelve joins ambition with awareness: forward movement guided by precision. This Knight’s pace is deliberate because he builds for endurance, not applause. Stability, not speed, achieves mastery.",
    "reversed": "Reversed, work may have become mechanical or stalled. Rigidity replaces rhythm. The energy of twelve reminds you to realign method with meaning — diligence becomes stagnation when curiosity fades. Reintroduce purpose, and momentum will return naturally.",
    "guidance": "Slow does not mean stuck. True mastery is the art of repetition with intention.",
    "call_to_action": "Dedicate time today to one steady task — not for results, but to remember the value of consistency."
  },
  {
    "name": "Knight of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 12,
      "meaning": "Twelve is intellect in motion — thought charging toward realization. It unites clarity with courage, testing ideas through the friction of reality."
    },
    "theme": "ambition, communication, decisive movement",
    "upright": "The Knight of Swords moves swiftly, guided by conviction. Upright, it signals mental clarity turned to momentum — goals pursued with focus and precision. The numerology of twelve transforms knowledge into action: this Knight learns by doing, by daring, by defending ideals. Yet wisdom grows when zeal meets mindfulness. Strategy must temper speed.",
    "reversed": "Reversed, haste distorts purpose. You may be fighting battles unworthy of your energy or rushing past nuance. The lesson of twelve warns that speed without listening breeds chaos. Pause long enough to confirm your aim before you strike.",
    "guidance": "The sharpest mind is one that knows when to soften. Thought becomes wisdom through reflection.",
    "call_to_action": "Choose one mission worth your full focus — act clearly, but let patience travel with you."
  },
  {
    "name": "Knight of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 12,
      "meaning": "Twelve is passion on a journey — the fire of initiative meeting the rhythm of learning. It is the explorer’s heartbeat, turning inspiration into adventure."
    },
    "theme": "exploration, enthusiasm, bold pursuit",
    "upright": "The Knight of Wands embodies fearless motion. Upright, it signals the impulse to act — to follow vision into uncharted territory. The numerology of twelve channels inspiration into exploration: courage seeking experience, instinct finding direction through movement. This Knight is charisma in motion, lighting the path ahead. Momentum thrives when intention is pure.",
    "reversed": "Reversed, impulse burns too quickly or misfires without aim. You may chase novelty over purpose. The energy of twelve reminds you that fire needs focus — passion without direction becomes smoke. Reignite intention before charging forward.",
    "guidance": "Adventure matures into purpose when guided by awareness, not just adrenaline.",
    "call_to_action": "Channel your energy into one inspired act — begin the journey, but let patience pack your bags."
  }
]
[
  {
    "name": "Queen of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 13,
      "meaning": "Thirteen is emotional mastery — the fusion of depth and discernment. It embodies love that listens, intuition that guides, and compassion that renews."
    },
    "theme": "empathy, intuition, emotional wisdom",
    "upright": "The Queen of Cups rules the realm of feeling through stillness and sensitivity. Upright, she embodies intuitive mastery — the ability to perceive beneath words and nurture without losing self. The numerology of thirteen turns emotion into understanding: compassion shaped by boundaries. Her strength is receptivity, her wisdom the courage to remain open. This Queen reminds you that gentleness is a form of power.",
    "reversed": "Reversed, empathy may blur into absorption. Overgiving drains intuition; emotion becomes noise instead of guidance. The energy of thirteen calls for re-centering — replenish before you pour again. Boundaries are not walls; they’re vessels that keep love sustainable.",
    "guidance": "Feel deeply but anchor firmly. Sensitivity guided by self-care becomes luminous clarity.",
    "call_to_action": "Take time for emotional cleansing — water, rest, or reflection — before extending energy to others."
  },
  {
    "name": "Queen of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 13,
      "meaning": "Thirteen is creation made practical — the harmony of nurture and structure. It turns care into sustainability, embodying abundance through stewardship."
    },
    "theme": "stability, generosity, grounded care",
    "upright": "The Queen of Pentacles cultivates comfort and security through steady devotion. Upright, she represents practical love — the art of caring for life’s details with grace. The numerology of thirteen blends transformation with structure: growth rooted in consistency. Her realm is hearth and home, prosperity shared through presence. She teaches that abundance is a rhythm of tending and trusting.",
    "reversed": "Reversed, over-responsibility may obscure joy. You might be giving to the point of depletion or neglecting your own nourishment. The lesson of thirteen urges balance: service that includes the self sustains both giver and gift.",
    "guidance": "Ground your care in reciprocity. True generosity restores the giver as well as the receiver.",
    "call_to_action": "Do one small act that honors your body’s comfort — a meal, a stretch, a pause — before returning to service."
  },
  {
    "name": "Queen of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 13,
      "meaning": "Thirteen is intellect refined by experience — truth filtered through compassion. It merges clarity with empathy, turning honesty into healing."
    },
    "theme": "clarity, communication, discernment",
    "upright": "The Queen of Swords governs thought with precision and grace. Upright, she embodies wisdom earned through honesty — intellect tempered by empathy. The numerology of thirteen reveals renewal through truth: the shedding of illusion to create integrity. Her strength lies in clear boundaries and direct communication. She teaches that compassion without clarity deceives, while clarity without compassion destroys. Wisdom lives between them.",
    "reversed": "Reversed, sharpness overwhelms softness. Logic cuts where listening could soothe. The energy of thirteen invites balance — to let intellect serve understanding, not control. Detachment must never become dismissal.",
    "guidance": "Speak truth as medicine, not as weapon. The calm mind heals more than the clever tongue.",
    "call_to_action": "Express a difficult truth with empathy today — clarity delivered kindly rewrites old patterns."
  },
  {
    "name": "Queen of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 13,
      "meaning": "Thirteen is creative sovereignty — transformation aflame with confidence. It symbolizes the union of will and warmth, leadership born of authenticity."
    },
    "theme": "confidence, vitality, inspired leadership",
    "upright": "The Queen of Wands radiates assured presence. Upright, she embodies magnetic creativity and fearless self-expression. The numerology of thirteen turns passion into stability: fire that sustains rather than consumes. Her charisma stems from integrity — she glows because she knows herself. This Queen teaches that true power inspires others to shine, not to shrink.",
    "reversed": "Reversed, insecurity hides behind performance or burnout dims brilliance. The number thirteen reminds you that confidence is maintained through authenticity, not approval. Reclaim energy by honoring your natural rhythm; the flame rekindles from rest.",
    "guidance": "Confidence grows from coherence — when action, intention, and self-worth align, light becomes effortless.",
    "call_to_action": "Do one thing boldly and unapologetically today — let joy, not validation, be the reason."
  }
]
[
  {
    "name": "King of Cups",
    "suit": "Cups",
    "numerology": {
      "number": 14,
      "meaning": "Fourteen is emotional authority — balance through empathy. It transforms feeling into guidance, teaching that stability and sensitivity can coexist in power."
    },
    "theme": "emotional balance, compassion, leadership through understanding",
    "upright": "The King of Cups leads through calm presence. Upright, he embodies mastery over emotion — not suppression, but serenity born of integration. The numerology of fourteen merges heart and reason: the wisdom to respond rather than react. His strength lies in emotional intelligence, his influence in quiet steadiness. True leadership begins when compassion governs choice.",
    "reversed": "Reversed, mood or manipulation may replace maturity. Emotional control becomes detachment, or empathy turns to overwhelm. The lesson of fourteen calls for re-grounding: center in sincerity before guiding others. Influence without integrity drains both giver and listener.",
    "guidance": "Emotional strength is measured not by restraint but by presence. Hold steady, and others will steady with you.",
    "call_to_action": "Respond to tension with empathy today — listen first, breathe second, act third."
  },
  {
    "name": "King of Pentacles",
    "suit": "Pentacles",
    "numerology": {
      "number": 14,
      "meaning": "Fourteen is prosperity in motion — stewardship that adapts. It teaches that abundance remains alive only through generosity and evolution."
    },
    "theme": "security, stewardship, grounded success",
    "upright": "The King of Pentacles represents mastery of the material world. Upright, he embodies patience, discipline, and tangible achievement. The numerology of fourteen marries stability with progress: the wisdom to manage resources while allowing growth. His wealth is responsibility made visible — a reminder that prosperity finds purpose when shared. This King governs through example, not excess.",
    "reversed": "Reversed, material focus may eclipse meaning. Control replaces care; success becomes rigidity. The number fourteen urges recalibration: leadership rooted in service, not superiority. True stability adapts with time — generosity keeps it alive.",
    "guidance": "Sustain abundance by staying generous. What you tend with gratitude continues to grow.",
    "call_to_action": "Contribute to something that reflects your values — let your resources ripple outward."
  },
  {
    "name": "King of Swords",
    "suit": "Swords",
    "numerology": {
      "number": 14,
      "meaning": "Fourteen is clarity in command — intellect applied with integrity. It unites logic and ethics, turning knowledge into justice and words into order."
    },
    "theme": "intellect, truth, ethical leadership",
    "upright": "The King of Swords rules through intellect sharpened by fairness. Upright, he embodies mental mastery: strategy without cruelty, precision without pride. The numerology of fourteen symbolizes balanced authority — wisdom that evolves with understanding. His command is clarity, his duty truth. When thought serves justice, the mind becomes a tool for liberation, not control.",
    "reversed": "Reversed, intellect becomes weaponized — manipulation, arrogance, or rigidity may distort judgment. The energy of fourteen calls for humility in leadership: wisdom learns by listening. Authority rooted in fear fractures; authority rooted in truth unites.",
    "guidance": "Use clarity to uplift, not to corner. The strongest voice is one that invites dialogue.",
    "call_to_action": "Lead one conversation with transparency today — speak plainly, but with empathy and purpose."
  },
  {
    "name": "King of Wands",
    "suit": "Wands",
    "numerology": {
      "number": 14,
      "meaning": "Fourteen is inspired mastery — fire that guides, not consumes. It transforms vision into leadership and passion into purpose shared."
    },
    "theme": "vision, charisma, creative leadership",
    "upright": "The King of Wands stands as the embodiment of visionary drive. Upright, he channels passion through discipline and confidence through purpose. The numerology of fourteen merges inspiration with adaptability: leadership that empowers rather than commands. His fire fuels others; his presence motivates growth. Charisma here is not performance but alignment — passion given structure.",
    "reversed": "Reversed, ambition may overheat into dominance or scattered pride. The number fourteen reminds you that leadership without empathy burns bridges faster than it builds them. Reignite balance by returning to vision, not vanity. Power shared multiplies; power hoarded isolates.",
    "guidance": "Lead by example, not expectation. True influence is felt, not forced.",
    "call_to_action": "Mentor or uplift someone today — channel your fire into inspiration that ignites another’s confidence."
  }
]
[
  {
    "name": "The Fool",
    "suit": "Major Arcana",
    "numerology": {
      "number": 0,
      "meaning": "Zero is potential unbound — the circle before form, infinite beginnings. It embodies innocence, openness, and trust in life’s unfolding mystery."
    },
    "theme": "beginnings, faith, spontaneity",
    "upright": "The Fool steps into the unknown with heart unguarded. Upright, it signifies new starts, curiosity, and the willingness to risk growth. The numerology of zero represents infinite possibility — the soul before story. To leap is to trust life’s improvisation. Innocence here is not ignorance, but sacred courage unburdened by fear of failure.",
    "reversed": "Reversed, the Fool warns of reckless naivety or paralyzing fear. You may mistake impulse for freedom or caution for wisdom. The lesson of zero reminds you that true spontaneity listens as it leaps. Balance adventure with awareness.",
    "guidance": "Embrace curiosity, but keep your eyes open. Wonder is freedom guided by attention.",
    "call_to_action": "Say yes to something unfamiliar today — a new idea, route, or rhythm — and meet it with curiosity instead of control."
  },
  {
    "name": "The Magician",
    "suit": "Major Arcana",
    "numerology": {
      "number": 1,
      "meaning": "One is manifestation — the point of focus where potential becomes form. It symbolizes willpower, confidence, and creation through conscious choice."
    },
    "theme": "manifestation, focus, empowered creation",
    "upright": "The Magician stands between worlds, translating thought into reality. Upright, it signifies self-trust, clarity of vision, and the mastery of intention. The numerology of one brings awareness into action: energy directed with purpose creates change. You hold the tools you need — mind, heart, voice, and hand. When they align, reality follows your lead.",
    "reversed": "Reversed, potential disperses. You may feel disconnected from your own power or misuse influence for validation. The lesson of one teaches alignment: integrity fuels magic; manipulation drains it. Reclaim intention before acting.",
    "guidance": "Power flows through clarity, not control. Focus your will where your heart agrees.",
    "call_to_action": "Name one intention aloud today, then take a single concrete step to anchor it in the physical world."
  },
  {
    "name": "The High Priestess",
    "suit": "Major Arcana",
    "numerology": {
      "number": 2,
      "meaning": "Two is duality and perception — the wisdom of balance, silence, and inner knowing. It reveals truth through stillness, not effort."
    },
    "theme": "intuition, mystery, spiritual insight",
    "upright": "The High Priestess embodies intuition and hidden knowledge. Upright, she invites you inward — to trust what whispers beneath logic. The numerology of two balances seen and unseen, reminding you that answers surface in still water. She is the keeper of your inner library; approach her with quiet reverence. What you seek is already waiting within.",
    "reversed": "Reversed, disconnection from intuition or avoidance of truth may cloud perception. The lesson of two is patience — the unknown unfolds in its own rhythm. Stop demanding clarity; listen until it reveals itself.",
    "guidance": "Wisdom grows in silence. Trust the pause between insight and understanding.",
    "call_to_action": "Spend time in stillness today — no input, only breath — and record what surfaces naturally."
  },
  {
    "name": "The Empress",
    "suit": "Major Arcana",
    "numerology": {
      "number": 3,
      "meaning": "Three is creation — expression made fertile. It represents abundance, nurture, and the harmony between body and spirit."
    },
    "theme": "abundance, creativity, sensual presence",
    "upright": "The Empress radiates the beauty of being. Upright, she embodies creativity, fertility, and the nourishment of both self and others. The numerology of three celebrates growth through connection: art, love, and life thrive when tended with joy. This is the card of embodiment — to create by feeling, to flourish by allowing. You are both garden and gardener.",
    "reversed": "Reversed, overextension or neglect may dull vitality. You may be giving without receiving or suppressing creative impulse. The energy of three reminds you that self-care sustains all creation. To nurture others, tend your own soil first.",
    "guidance": "Abundance flows through appreciation. The more you savor, the more life responds.",
    "call_to_action": "Indulge one sensory joy today — a meal, scent, sound, or touch — as an act of gratitude for being alive."
  },
  {
    "name": "The Emperor",
    "suit": "Major Arcana",
    "numerology": {
      "number": 4,
      "meaning": "Four is foundation — stability made conscious. It symbolizes order, leadership, and the will to build structures that last."
    },
    "theme": "authority, discipline, grounded control",
    "upright": "The Emperor embodies structure and stewardship. Upright, he represents discipline applied wisely — boundaries that protect, not confine. The numerology of four grounds vision into form: willpower guided by ethics. This is mastery through accountability, the architect of purpose. Lead not through dominance but through dependability.",
    "reversed": "Reversed, rigidity or overcontrol suffocates flow. Authority may harden into tyranny, or fear masquerade as order. The lesson of four is balance — strength serves best when it remains flexible.",
    "guidance": "True control is stewardship, not suppression. Strength listens as it commands.",
    "call_to_action": "Bring order to one area of chaos today — not through force, but through mindful structure."
  },
  {
    "name": "The Hierophant",
    "suit": "Major Arcana",
    "numerology": {
      "number": 5,
      "meaning": "Five is adaptation within tradition — the bridge between faith and freedom. It challenges systems to evolve without losing meaning."
    },
    "theme": "wisdom, teaching, spiritual structure",
    "upright": "The Hierophant represents sacred learning and spiritual lineage. Upright, it calls you to connect with wisdom passed through generations — mentors, rituals, philosophies. The numerology of five brings motion to doctrine, asking how old truths can evolve into living relevance. Learn the rules before you reinvent them. Knowledge becomes sacred when it liberates, not confines.",
    "reversed": "Reversed, dogma replaces devotion. You may reject tradition entirely or follow it blindly. The energy of five urges balance: question with respect, honor without submission. Truth expands when allowed to breathe.",
    "guidance": "Spiritual wisdom is a conversation, not a commandment. Listen, then interpret for yourself.",
    "call_to_action": "Revisit one belief you inherited — ask whether it still nourishes your growth or merely maintains comfort."
  },
  {
    "name": "The Lovers",
    "suit": "Major Arcana",
    "numerology": {
      "number": 6,
      "meaning": "Six is union and harmony — choice informed by love. It represents integration between self and other, desire and devotion."
    },
    "theme": "connection, alignment, conscious choice",
    "upright": "The Lovers unite dualities through conscious decision. Upright, they represent relationships, values, and alignment of heart with action. The numerology of six teaches balance through love — the sacred mirror that reveals self through connection. This card is less about romance and more about truth: what you choose binds you to what you become.",
    "reversed": "Reversed, imbalance or avoidance of commitment creates discord. The lesson of six reminds you that indecision is also a choice. When love feels unclear, return to integrity — connection must include the self to be whole.",
    "guidance": "Love wisely, choose freely. Union thrives when honesty leads.",
    "call_to_action": "Reflect on one choice before you: does it honor both your heart and your truth?"
  }
]
[
  {
    "name": "The Chariot",
    "suit": "Major Arcana",
    "numerology": {
      "number": 7,
      "meaning": "Seven is control through consciousness — victory born of alignment. It represents the will harnessed by wisdom, movement guided by purpose."
    },
    "theme": "determination, self-mastery, focused drive",
    "upright": "The Chariot charges forward with confidence and clarity. Upright, it symbolizes the discipline that channels desire into direction. The numerology of seven marks victory through inner balance — opposing forces brought under one will. You succeed not by domination, but by integration. Progress accelerates when purpose steers passion.",
    "reversed": "Reversed, momentum falters through scattered focus or inner conflict. You may feel pulled between choices or goals. The lesson of seven urges recalibration: align motive with method before advancing. Control is not force; it’s coherence.",
    "guidance": "True progress requires inner unity. When your emotions and intentions agree, success becomes inevitable.",
    "call_to_action": "Define one clear objective today and align your actions behind it — precision is power."
  },
  {
    "name": "Strength",
    "suit": "Major Arcana",
    "numerology": {
      "number": 8,
      "meaning": "Eight is balance through endurance — mastery refined by compassion. It teaches that true strength is the calm that tames chaos without suppressing it."
    },
    "theme": "courage, patience, gentle power",
    "upright": "Strength reveals power as grace. Upright, it speaks of resilience through empathy — the ability to influence without aggression. The numerology of eight brings equilibrium to instinct: passion disciplined through love. The heart conquers what the fist cannot. Your gentleness is not weakness; it’s wisdom wielded with humility.",
    "reversed": "Reversed, fear or frustration replaces patience. You may doubt your stamina or mistake control for courage. The lesson of eight reminds you: calm is an act of command. Restore faith in your resilience by acting with kindness first.",
    "guidance": "Softness can be the fiercest form of strength. Lead with compassion and courage follows naturally.",
    "call_to_action": "Approach one challenge with tenderness instead of tension — your calm will shift its outcome."
  },
  {
    "name": "The Hermit",
    "suit": "Major Arcana",
    "numerology": {
      "number": 9,
      "meaning": "Nine is introspection — light turned inward. It symbolizes wisdom born of solitude and the quiet clarity that guides others by example."
    },
    "theme": "introspection, guidance, spiritual wisdom",
    "upright": "The Hermit withdraws not to escape but to illuminate. Upright, it invites stillness for reflection and self-discovery. The numerology of nine refines awareness into teaching: solitude becomes sanctuary, not exile. Your inner light grows brightest when it’s protected by silence. Seek depth, not distraction — the answers you chase are already within your lantern.",
    "reversed": "Reversed, isolation becomes avoidance. You may resist guidance or feel lost in your own introspection. The lesson of nine is balance — solitude should replenish, not consume. Step back into connection when wisdom begins to echo instead of expand.",
    "guidance": "Retreat to refine your light, but return to share it. Illumination is meant to be offered, not hoarded.",
    "call_to_action": "Spend time alone today without agenda. Let silence reveal what clarity has been waiting to say."
  },
  {
    "name": "Wheel of Fortune",
    "suit": "Major Arcana",
    "numerology": {
      "number": 10,
      "meaning": "Ten is completion in motion — the cycle that renews itself. It embodies destiny, timing, and the turning interplay between choice and chance."
    },
    "theme": "change, destiny, cycles of renewal",
    "upright": "The Wheel of Fortune turns with divine rhythm. Upright, it brings shifts in fate — opportunities arising through timing and alignment. The numerology of ten reveals the dance between free will and the greater pattern. When change arrives, meet it with flexibility. What feels like chance often mirrors your readiness to evolve.",
    "reversed": "Reversed, resistance to change halts the wheel. You may feel stuck or unlucky, yet stagnation often signals misalignment, not fate. The energy of ten urges surrender — flow returns when control loosens. Every ending is a beginning in disguise.",
    "guidance": "Fate moves with you, not against you. Align intention with acceptance, and the wheel turns effortlessly.",
    "call_to_action": "Reframe one setback as redirection — ask how it might actually be working in your favor."
  },
  {
    "name": "Justice",
    "suit": "Major Arcana",
    "numerology": {
      "number": 11,
      "meaning": "Eleven is equilibrium made conscious — the mirror of cause and effect. It teaches awareness of balance, truth, and responsibility."
    },
    "theme": "truth, fairness, moral clarity",
    "upright": "Justice weighs decisions with truth as her compass. Upright, she calls for accountability, integrity, and discernment. The numerology of eleven amplifies awareness — intuition meeting intellect in perfect measure. Every choice creates a ripple; awareness ensures it aligns with your values. Act transparently, and harmony follows naturally.",
    "reversed": "Reversed, bias, avoidance, or denial may distort fairness. The energy of eleven demands reflection — where have you ignored your own truth? Justice delayed within becomes conflict projected outward. Reclaim balance by confronting what you fear to admit.",
    "guidance": "Truth liberates more than it punishes. Honesty, even when difficult, restores equilibrium.",
    "call_to_action": "Speak or act in alignment with your principles today — even a small integrity restores immense peace."
  },
  {
    "name": "The Hanged Man",
    "suit": "Major Arcana",
    "numerology": {
      "number": 12,
      "meaning": "Twelve is surrender in service of transformation — perspective released into revelation. It represents wisdom through pause, renewal through letting go."
    },
    "theme": "sacrifice, new perspective, surrender",
    "upright": "The Hanged Man invites a sacred pause. Upright, it represents seeing from a new angle — yielding control to gain insight. The numerology of twelve transforms tension into trust: stillness opens revelation where resistance closed it. Let inversion become initiation; surrender is not defeat but reorientation toward truth.",
    "reversed": "Reversed, stagnation masquerades as patience. You may cling to discomfort out of fear to act. The lesson of twelve is conscious surrender, not passive waiting. Choose release over resentment. Freedom follows perspective.",
    "guidance": "When movement halts, shift your view instead. Wisdom often hides in the angle you resist.",
    "call_to_action": "Pause intentionally today — examine one frustration from the opposite point of view."
  },
  {
    "name": "Death",
    "suit": "Major Arcana",
    "numerology": {
      "number": 13,
      "meaning": "Thirteen is transformation — endings as evolution. It teaches that decay is not destruction but renewal disguised as release."
    },
    "theme": "transformation, release, renewal",
    "upright": "Death closes one cycle to nourish another. Upright, it signifies metamorphosis — the necessary shedding before rebirth. The numerology of thirteen dissolves fear into faith: everything that falls away feeds what will grow next. Grieve what’s gone, but honor its purpose. Transformation is the soul’s natural rhythm.",
    "reversed": "Reversed, resistance to change prolongs pain. You may cling to what’s already complete. The energy of thirteen reminds you that endings are invitations, not threats. Let go consciously, and renewal accelerates.",
    "guidance": "Every ending is an initiation in disguise. Allow closure to create space for resurrection.",
    "call_to_action": "Release one attachment that no longer serves you — ritualize the letting go with gratitude, not grief."
  }
]
[
  {
    "name": "Temperance",
    "suit": "Major Arcana",
    "numerology": {
      "number": 14,
      "meaning": "Fourteen is harmony through adaptation — the dance between extremes. It teaches integration, patience, and balance born from flow rather than force."
    },
    "theme": "balance, moderation, inner alchemy",
    "upright": "Temperance blends fire and water into equilibrium. Upright, it calls for moderation, patience, and synthesis. The numerology of fourteen reduces to five — transformation through grace. This card embodies the art of adjustment, the wisdom of pacing yourself through change. Healing occurs when you stop dividing life into opposites and begin weaving it into wholeness.",
    "reversed": "Reversed, imbalance or haste disrupts harmony. You may be pushing instead of integrating, striving rather than aligning. The lesson of fourteen reminds you that time itself can be an ally. Stillness is sometimes the most productive act.",
    "guidance": "Harmony is not achieved, it’s practiced — a continual dance between intention and allowance.",
    "call_to_action": "Blend rather than battle today — find one middle path that honors both passion and peace."
  },
  {
    "name": "The Devil",
    "suit": "Major Arcana",
    "numerology": {
      "number": 15,
      "meaning": "Fifteen is desire’s mirror — the confrontation with shadow. It teaches awareness through attachment, showing that what binds also reveals what we crave most deeply."
    },
    "theme": "temptation, awareness, reclaiming power",
    "upright": "The Devil exposes the illusions that chain you. Upright, it represents addiction, fear, or fixation — yet its true message is liberation through awareness. The numerology of fifteen reduces to six: harmony distorted through imbalance. This card reminds you that darkness loses control once named. What imprisons you also points to what you most long to master.",
    "reversed": "Reversed, release has begun. The spell breaks as you recognize the pattern. The energy of fifteen teaches accountability — freedom reclaimed through choice. Compassion for your shadow transforms it into strength.",
    "guidance": "Awareness dissolves bondage. Confront what scares you, and its grip will soften.",
    "call_to_action": "Name one pattern of fear or habit today — seeing it clearly is the first act of freedom."
  },
  {
    "name": "The Tower",
    "suit": "Major Arcana",
    "numerology": {
      "number": 16,
      "meaning": "Sixteen is revelation — truth striking illusion. It dismantles false structures so that authenticity can rise in their place."
    },
    "theme": "awakening, upheaval, liberation through truth",
    "upright": "The Tower falls to free you from confinement. Upright, it represents sudden change, collapse, or realization that shatters old certainty. The numerology of sixteen reduces to seven — control surrendering to consciousness. Chaos here is creative destruction: truth cracking open what fear built. Let what’s unstable fall; what remains will be real.",
    "reversed": "Reversed, resistance prolongs collapse. You may cling to the familiar even as it crumbles. The lesson of sixteen urges surrender — destruction clears the ground for renewal. Let endings rewrite you, not erase you.",
    "guidance": "Sometimes clarity arrives as thunder. Trust that what breaks now was never truly yours to keep.",
    "call_to_action": "Allow one truth to change you today — release defense, and let transformation begin its work."
  },
  {
    "name": "The Star",
    "suit": "Major Arcana",
    "numerology": {
      "number": 17,
      "meaning": "Seventeen is renewal through faith — light returning after loss. It embodies hope, inspiration, and the soul’s quiet recalibration toward purpose."
    },
    "theme": "hope, inspiration, spiritual renewal",
    "upright": "The Star shines as a promise after the storm. Upright, it speaks of healing, clarity, and the gentle return of trust. The numerology of seventeen reduces to eight — balance restored through grace. This card is the soul’s breath after struggle: a reminder that vulnerability glows brighter than perfection. Believe again — your path realigns with peace.",
    "reversed": "Reversed, doubt dims the inner light. You may feel disconnected from hope or impatient with recovery. The energy of seventeen invites gentleness: healing unfolds, not performs. Faith is an act of courage repeated daily.",
    "guidance": "Hope is not a wish but a practice — a willingness to imagine light while still standing in the dark.",
    "call_to_action": "Nurture optimism in one small way — a breath, a word, a creative spark — and let it ripple outward."
  },
  {
    "name": "The Moon",
    "suit": "Major Arcana",
    "numerology": {
      "number": 18,
      "meaning": "Eighteen is intuition’s tide — illusion meeting imagination. It teaches that clarity is cyclical and that shadow is simply light not yet understood."
    },
    "theme": "intuition, illusion, subconscious revelation",
    "upright": "The Moon invites you into mystery. Upright, it reveals dreams, intuition, and the landscapes beneath logic. The numerology of eighteen reduces to nine — introspection illuminated by instinct. Trust perception without demanding proof. This card reminds you that uncertainty is a teacher, not a threat. Move by feeling, not fear.",
    "reversed": "Reversed, confusion or deception clouds the path. The lesson of eighteen reminds you that clarity blooms through trust in your senses. Denying emotion only deepens illusion. Let curiosity guide you through the fog — every shadow conceals insight.",
    "guidance": "You don’t need all the answers to move wisely. The unknown is an ally to those who listen deeply.",
    "call_to_action": "Journal one vivid dream or intuition today — treat it as a message worth deciphering, not dismissing."
  },
  {
    "name": "The Sun",
    "suit": "Major Arcana",
    "numerology": {
      "number": 19,
      "meaning": "Nineteen is illumination — joy made conscious. It represents vitality, authenticity, and the celebration of clarity regained."
    },
    "theme": "joy, vitality, enlightenment",
    "upright": "The Sun radiates renewal and truth. Upright, it signifies joy, success, and self-acceptance. The numerology of nineteen reduces to ten — completion that begins anew. This is the moment of confidence born from alignment: when inner and outer worlds shine together. Light does not chase darkness; it simply reveals it was never separate.",
    "reversed": "Reversed, doubt dims enthusiasm. You may overlook small joys while chasing grand ones. The energy of nineteen reminds you that light is presence, not performance. Return to simplicity; happiness thrives where authenticity lives.",
    "guidance": "Joy is your birthright, not a reward. Let yourself feel it without reason or restraint.",
    "call_to_action": "Do something today purely for delight — the world heals a little each time you choose joy."
  },
  {
    "name": "Judgement",
    "suit": "Major Arcana",
    "numerology": {
      "number": 20,
      "meaning": "Twenty is awakening — realization rising from reflection. It merges past and present into purpose, calling the soul to conscious renewal."
    },
    "theme": "rebirth, accountability, spiritual awakening",
    "upright": "Judgement signals rebirth through recognition. Upright, it represents self-evaluation, forgiveness, and awakening to higher purpose. The numerology of twenty reduces to two — balance restored through awareness. This card is the trumpet of clarity, asking you to answer your calling free of shame. What once felt like failure now reveals itself as preparation.",
    "reversed": "Reversed, avoidance or self-criticism blocks redemption. You may cling to old guilt instead of learning from it. The lesson of twenty is compassion — awakening requires forgiveness, not perfection. Let understanding resurrect your courage.",
    "guidance": "Awakening is not an arrival but a remembering. Grace begins where judgment ends.",
    "call_to_action": "Release one self-blame you’ve outgrown — speak to yourself with the mercy you extend to others."
  },
  {
    "name": "The World",
    "suit": "Major Arcana",
    "numerology": {
      "number": 21,
      "meaning": "Twenty-one is completion through integration — unity achieved by embracing diversity. It celebrates wholeness, mastery, and the infinite return to beginning."
    },
    "theme": "fulfillment, integration, completion",
    "upright": "The World crowns the Fool’s journey with harmony. Upright, it signifies completion, success, and belonging — the dance between effort and grace. The numerology of twenty-one reduces to three: creation reborn through understanding. You’ve gathered the lessons; now live them. The circle closes only to open again.",
    "reversed": "Reversed, incompletion or resistance to closure lingers. You may fear what comes after success or cling to old identities. The energy of twenty-one encourages release — fulfillment is not loss; it’s transformation. Endings invite expansion.",
    "guidance": "Celebrate how far you’ve come. The horizon is simply the next beginning in disguise.",
    "call_to_action": "Mark a milestone with ritual or reflection today — honor your growth before you step forward again."
  }
]